import pandas as pd
import pytest
from datetime import datetime

@pytest.fixture
def sample_transactions_df():
    """Фикстура с примерными данными транзакций"""
    data = {
            "Дата операции": [
                "01.01.2024 10:00:00",
                "15.01.2024 14:30:00",
                "20.01.2024 09:15:00",
                "25.01.2024 16:45:00",
                "05.02.2024 11:20:00",  # За пределами января
            ],
            "Номер карты": ["1234567812345678", "1234567812345678", "8765432187654321", "1234567812345678", "8765432187654321"],
            "Сумма операции": [-1000.50, -2500.75, -500.25, -7500.00, -2000.00],
            "Сумма платежа": [-1000.50, -2500.75, -500.25, -7500.00, -2000.00],
            "Категория": ["Супермаркеты", "Рестораны", "Транспорт", "Электроника", "Развлечения"],
            "Описание": ["Покупка в магазине", "Ужин в ресторане", "Такси", "Ноутбук", "Кино"]
        }
    return pd.DataFrame(data)


@pytest.fixture
def empty_transactions_df():
    """Фикстура с пустым DataFrame"""
    return pd.DataFrame(columns=["Дата операции",
                                 "Номер карты",
                                 "Сумма операции",
                                 "Сумма платежа",
                                 "Категория",
                                 "Описание"])