import pandas as pd
import pytest
from datetime import datetime
from unittest.mock import patch, MagicMock

from src import views


# Фикстуры для тестов модуля views.py
@pytest.fixture
def sample_transactions_df():
    """Фикстура с примерными данными транзакций"""
    data = {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 01:23:42",
                "30.12.2021 19:18:22",
                "30.12.2021 17:50:30",
                "09.11.2021 18:40:20",  # Транзакция должна быть отфильтрована
            ],
            "Номер карты": ["1234567812347197", "1234567812345091", "1234567812345091", "1234567812344556", "1234567812347197"],
            "Сумма операции": [-160.89, -564.00, -7.07, 5046.00, -7240.00],
            "Сумма платежа": [-160.89, -564.00, -7.07, 5046.00, -7240.00],
            "Категория": ["Супермаркеты", "Различные товары", "Каршеринг", "Пополнение", "Медицина"],
            "Описание": ["Колхоз", "Ozon.ru", "Ситидрайв", "Пополнение через Газпромбанк", "Eurooptica"]
        }
    return pd.DataFrame(data)


@pytest.fixture
def empty_transactions_df():
    """Фикстура с пустым DataFrame"""
    return pd.DataFrame(columns=["Дата операции",
                                 "Номер карты",
                                 "Сумма операции",
                                 "Сумма платежа",
                                 "Категория",
                                 "Описание"])


@pytest.fixture
def mock_user_settings():
    """Фикстура с моком пользовательских настроек"""
    return {
        "user_currencies": ["USD", "EUR"],
        "user_stocks": ["AAPL", "AMZN", "GOOGL"]
    }




# Фикстуры для тестов модуля services.py
@pytest.fixture
def sample_transactions():
    """Фикстура с примерными транзакциями."""
    return [
        {"Дата операции": "31.12.2021 16:44:00", "Сумма операции": -160.89},
        {"Дата операции": "31.12.2021 16:42:04", "Сумма операции": -64.00},
        {"Дата операции": "30.12.2021 17:50:30", "Сумма операции": 5046.00},
        {"Дата операции": "30.12.2021 17:50:17", "Сумма операции": 174000.00},
        {"Дата операции": "30.12.2021 14:48:25", "Сумма операции": -349.00},
        {"Дата операции": "29.11.2021 19:48:21", "Сумма операции": -200.00},
    ]


@pytest.fixture
def edge_case_transactions():
    """Фикстура с граничными случаями транзакций."""
    return [
        {"Дата операции": "31.12.2021 16:44:00", "Сумма операции": -10.00},
        {"Дата операции": "31.12.2021 16:42:04", "Сумма операции": -100.00},
        {"Дата операции": "30.12.2021 17:50:30", "Сумма операции": -0.01},
        {"Дата операции": "29.11.2021 19:48:21", "Сумма операции": -999.99},
    ]


@pytest.fixture
def invalid_transactions():
    """Фикстура с некорректными транзакциями."""
    return [
        {"Дата операции": "31.12.2021 16:44:00"}, # Нет суммы
        {"Сумма операции": -64.00}, # Нет даты
        {"Дата операции": "имеется", "Сумма операции": -349.00},
        {"Дата операции": "30.12.2021 17:50:17", "Сумма операции": "имеется"},
    ]


@pytest.fixture
def extended_sample_transaction_df():
    """Фикстура с примерными данными транзакций"""
    data = {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 01:23:42",
                "30.12.2021 19:18:22",
                "30.12.2021 17:50:30",
                "09.11.2021 18:40:20",  # Транзакция должна быть отфильтрована
                "06.12.2021 16:22:13"
            ],
            "Номер карты": ["1234567812347197", "1234567812345091", "1234567812345091", "1234567812344556", "1234567812347197", "1234567812345091"],
            "Сумма операции": [-160.89, -564.00, -7.07, 5046.00, -7240.00, -179.77],
            "Сумма платежа": [-160.89, -564.00, -7.07, 5046.00, -7240.00, -179.77],
            "Категория": ["Супермаркеты", "Различные товары", "Каршеринг", "Пополнение", "Медицина", "Супермаркеты"],
            "Описание": ["Колхоз", "Ozon.ru", "Ситидрайв", "Пополнение через Газпромбанк", "Eurooptica", "Дикси"]
        }
    return pd.DataFrame(data)

